app/views/photos/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
---
      </td>
      <% if  photo.comments.size == 0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
---
        <table>
        <% photo.comments.each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
              <td>
                <%= link_to "#{comment.user.first_name} #{comment.user.last_name}", user_photos_path(comment.user_id) %>